pipeFlowReg/case2_transient1/constant/zoneone/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/zoneone/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       15760;
    }
    zoneone_to_zonetwo
    {
        type            mapped;
        inGroups        List<word> 1(mapped);
        nFaces          40;
        startFace       15800;
        neighbourRegion zonetwo;
        neighbourPatch  zonetwo_to_zoneone;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       15840;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       16040;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          8000;
        startFace       16040;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          8000;
        startFace       24040;
    }
)

// ************************************************************************* //
