pipeFlowReg/case2_transient1/constant/zonetwo/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/zonetwo/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    zonetwo_to_zoneone
    {
        type            mapped;
        inGroups        List<word> 1(mapped);
        nFaces          40;
        startFace       23660;
        neighbourRegion zoneone;
        neighbourPatch  zoneone_to_zonetwo;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       23700;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       23740;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       24040;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          12000;
        startFace       24040;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          12000;
        startFace       36040;
    }
)

// ************************************************************************* //
