pipeFlowReg/case2_transient1/system/blockMeshDict1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (-5 -1 0)   //0
    (-5 -1 0.1)    //1
    (-5 1 0.1)     //2
    (-5 1 0)    //3
    (-2 -1 0)    //4--
    (-2 -1 0.1)  //5--
    (-2 1 0.1)   //6--
    (-2 1 0)     //7--
    (5 -1 0) //8
    (5 -1 0.1)  //9
    (5 1 0.1)   //10
    (5 1 0)  //11
);

blocks
(
    hex (4 5 6 7 0 1 2 3 ) (1 20 30) simpleGrading (1 1 1)
    hex (8 9 10 11 4 5 6 7 ) (1 20 70) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 4 5)
            (2 3 6 7)
            (4 5 8 9)
            (6 7 10 11)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 7)
            (1 2 5 6)
            (4 7 8 11)
            (5 6 9 10 )
        );
    }
);


// ************************************************************************* //
